In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
sample = pd.DataFrame(np.random.randn(4,5),columns = ['a','b','c','d','e'])

In [4]:
sample

          a         b         c         d         e
0  0.126917  0.154662  0.105825 -0.492680 -1.111531
1 -1.491444  0.512221  0.908649 -0.489733 -0.865491
2 -1.431227 -0.554035 -0.321970  2.114362 -0.431828
3 -0.247981  1.760124 -0.575325  0.252193  1.127991

In [5]:
sample['new_column'] = sample['a']-sample['b']

In [6]:
sample

          a         b         c         d         e  new_column
0  0.126917  0.154662  0.105825 -0.492680 -1.111531   -0.027745
1 -1.491444  0.512221  0.908649 -0.489733 -0.865491   -2.003664
2 -1.431227 -0.554035 -0.321970  2.114362 -0.431828   -0.877193
3 -0.247981  1.760124 -0.575325  0.252193  1.127991   -2.008105

In [7]:
sample.assign(new1 = sample['a']-sample['b'],new2 = sample['a']+sample['b'] )

,a,b,c,d,e,new_column,new1,new2
0,0.126917,0.154662,0.105825,-0.492680,-1.111531,-0.027745,-0.027745,0.281579
1,-1.491444,0.512221,0.908649,-0.489733,-0.865491,-2.003664,-2.003664,-0.979223
2,-1.431227,-0.554035,-0.321970,2.114362,-0.431828,-0.877193,-0.877193,-1.985262
3,-0.247981,1.760124,-0.575325,0.252193,1.127991,-2.008105,-2.008105,1.512143